# Contents
[Read-write-display a data frame](#Read-write-display-a-data-frame)
- pd.read_csv()
- pd.options.display.max_rows = 10
- pd.DataFrame({'col1':[1,2,3], 'col2':[1,2,3]})
- set_index
- rename_axis

[Basic data frame summary](#Basic-data-frame-summary)
- df.shape
- df.columns
- df.dropna(axis=0)
- df.describe()
- df.loc
- df.iloc
- df.count()
- df.head()

## Data Frame vs. Series

## Groudby
- hist()
- plot.bar()
[Reference](https://www.kaggle.com/learn-forum/60581)
- MultiIndex 
[Reference](https://jakevdp.github.io/PythonDataScienceHandbook/03.05-hierarchical-indexing.html)

## Merge

## Misc
- \[index for index in aa if aa>1\]
- a=\{x: function(x) for x in range\}, min(a,key=a.get)
- plot label rotation
[Reference](https://www.drawingfromdata.com/how-to-rotate-axis-labels-in-seaborn-and-matplotlib)
- datatime
-  scikit-learn library 
   - from sklearn.tree import DecisionTreeRegressor
   - model = DecisionTreeRegressor(random_state=1) 
   - model.fit(x,y)
   - model.predict(xxx)
   - from sklearn.metrics import mean_absolute_error
   - from sklearn.model_selection import train_test_split
- print format
   - print("blah: %d" %dataname)
   - print("blah: {:,.0f}".format(dataname))

# Read write display a data frame
[Return to Contents](#Contents)

In [1]:
# if you don't have pandas installed, run 'pip install pandas' in terminal
import pandas as pd

In [25]:
### wrong ####
df = pd.read_table('exam0203.txt', delimiter="\t")
df.head()

  Name     Sex     Age   Height     Weight
0  Alice     F      13     56.5       84.0
1  Becka     F      13     65.3       98.0
2  Gail      F      14     64.3       90.0
3  Karen     F      12     56.3       77.0
4  Kathy     F      12     59.8       84.5

In [29]:
### correct ###
# If there is no header in the txt file, use commented line
# 'df = pd.read_table('exam0203.txt', delim_whitespace=True, header=None)'
df = pd.read_table('exam0203.txt', delim_whitespace=True)

In [30]:
df #display everything

       Name Sex  Age  Height  Weight
0     Alice   F   13    56.5    84.0
1     Becka   F   13    65.3    98.0
2      Gail   F   14    64.3    90.0
3     Karen   F   12    56.3    77.0
4     Kathy   F   12    59.8    84.5
5      Mary   F   15    66.5   112.0
6     Sandy   F   11    51.3    50.5
7    Sharon   F   15    62.5   112.5
8     Tammy   F   14    62.8   102.5
9    Alfred   M   14    69.0   112.5
10     Duke   M   14    63.5   102.5
11    Guido   M   15    67.0   133.0
12    James   M   12    57.3    83.0
13  Jeffrey   M   13    62.5    84.0
14     John   M   12    59.0    99.5
15   Philip   M   16    72.0   150.0
16   Robert   M   12    64.8   128.0
17   Thomas   M   11    57.5    85.0
18  William   M   15    66.5   112.0

In [32]:
df.head()  #display the first five rows, () is needed since this is a method not attribute

    Name Sex  Age  Height  Weight
0  Alice   F   13    56.5    84.0
1  Becka   F   13    65.3    98.0
2   Gail   F   14    64.3    90.0
3  Karen   F   12    56.3    77.0
4  Kathy   F   12    59.8    84.5

In [33]:
df.head(3)  #display the first three rows

    Name Sex  Age  Height  Weight
0  Alice   F   13    56.5    84.0
1  Becka   F   13    65.3    98.0
2   Gail   F   14    64.3    90.0

To test the differences between `loc` and `iloc`, we first change the index name

In [37]:
df.index = ['1st','2nd','3rd','4th','5th','6th','7th','8th','9th','10th',\
           '11st','12nd','13rd','14th','15th','16th','17th','18th','19th']

In [38]:
df

         Name Sex  Age  Height  Weight
1st     Alice   F   13    56.5    84.0
2nd     Becka   F   13    65.3    98.0
3rd      Gail   F   14    64.3    90.0
4th     Karen   F   12    56.3    77.0
5th     Kathy   F   12    59.8    84.5
6th      Mary   F   15    66.5   112.0
7th     Sandy   F   11    51.3    50.5
8th    Sharon   F   15    62.5   112.5
9th     Tammy   F   14    62.8   102.5
10th   Alfred   M   14    69.0   112.5
11st     Duke   M   14    63.5   102.5
12nd    Guido   M   15    67.0   133.0
13rd    James   M   12    57.3    83.0
14th  Jeffrey   M   13    62.5    84.0
15th     John   M   12    59.0    99.5
16th   Philip   M   16    72.0   150.0
17th   Robert   M   12    64.8   128.0
18th   Thomas   M   11    57.5    85.0
19th  William   M   15    66.5   112.0

In [39]:
df.loc['1st']   #display a certain row using index name

Name      Alice
Sex           F
Age          13
Height     56.5
Weight       84
Name: 1st, dtype: object

In [42]:
df.iloc[0]      #display a certain row using index

Name      Alice
Sex           F
Age          13
Height     56.5
Weight       84
Name: 1st, dtype: object

In [49]:
pd.options.display.max_rows = 10   #display setting
df

         Name Sex  Age  Height  Weight
1st     Alice   F   13    56.5    84.0
2nd     Becka   F   13    65.3    98.0
3rd      Gail   F   14    64.3    90.0
4th     Karen   F   12    56.3    77.0
5th     Kathy   F   12    59.8    84.5
...       ...  ..  ...     ...     ...
15th     John   M   12    59.0    99.5
16th   Philip   M   16    72.0   150.0
17th   Robert   M   12    64.8   128.0
18th   Thomas   M   11    57.5    85.0
19th  William   M   15    66.5   112.0

[19 rows x 5 columns]

If you want to manually create a data frame, here is the way:

In [46]:
df_man = pd.DataFrame({'col1':[1,2,3], 'col2':[1,2,3]})
df_man

   col1  col2
0     1     1
1     2     2
2     3     3

You can also directly change the index name when creating the data frame manually

In [45]:
df_man = pd.DataFrame({'col1':[1,2,3], 'col2':[1,2,3]}, index=['Row1','Row2','Row2'])
df_man

      col1  col2
Row1     1     1
Row2     2     2
Row2     3     3

# Basic data frame summary
[Return to Contents](#Contents)

In [51]:
df.shape  #return the shape of the data frame, don't put (), shape is an attribute not method

(19, 5)

In [52]:
df.columns   #return the names of each column

Index(['Name', 'Sex', 'Age', 'Height', 'Weight'], dtype='object')

[pd.dropna](https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.DataFrame.dropna.html)

`DataFrame.dropna(self, axis=0, how='any', thresh=None, subset=None, inplace=False)`

In [53]:
import numpy as np

In [83]:
df_na = pd.DataFrame({'col1':[np.nan,2,3], 'col2':[np.nan,2,3], 'col3':[1,2,3]}, index=['Row1','Row2','Row2'])
df_na

      col1  col2  col3
Row1   NaN   NaN     1
Row2   2.0   2.0     2
Row2   3.0   3.0     3

In [57]:
df_na.dropna(axis=0)   #remove the row with NaN, 0 is default

      col1  col2  col3
Row2   2.0   2.0     2
Row2   3.0   3.0     3

In [61]:
df_na.dropna()

      col1  col2  col3
Row2   2.0   2.0     2
Row2   3.0   3.0     3

In [58]:
df_na.dropna(axis=1)   #remove the column with NaN

      col3
Row1     1
Row2     2
Row2     3

In [62]:
df_na.dropna(how='any')   #remove the row as long as there is NaN

      col1  col2  col3
Row2   2.0   2.0     2
Row2   3.0   3.0     3

In [63]:
df_na.dropna(how='all')   #remove the row only when NaN is everywhere

      col1  col2  col3
Row1   NaN   NaN     1
Row2   2.0   2.0     2
Row2   3.0   3.0     3

In [72]:
df_na.dropna(thresh=1)   #remove the row if there are not enough 'thresh' non-NaN

      col1  col2  col3
Row1   NaN   NaN     1
Row2   2.0   2.0     2
Row2   3.0   3.0     3

In [79]:
df_na.dropna(subset=['col1'])    #apply dropna to the data frame corresponding to 'subset'

      col1  col2  col3
Row2   2.0   2.0     2
Row2   3.0   3.0     3

In [80]:
df_na.dropna(subset=['col3'])

      col1  col2  col3
Row1   NaN   NaN     1
Row2   2.0   2.0     2
Row2   3.0   3.0     3

In [82]:
df_na.dropna(inplace=True) 
df_na

      col1  col2  col3
Row2   2.0   2.0     2
Row2   3.0   3.0     3

In [84]:
df_na.dropna(inplace=False)
df_na

      col1  col2  col3
Row1   NaN   NaN     1
Row2   2.0   2.0     2
Row2   3.0   3.0     3